---
kind: property
id: P:Autodesk.Revit.DB.CombinableElementArray.Item(System.Int32)
source: html/5a1fd0a8-c11d-ee5a-d2c1-c31d3cb0e160.htm
---
# Autodesk.Revit.DB.CombinableElementArray.Item Property

Gets or sets a CombinableElement at a specified index within the array.

## Syntax (C#)
```csharp
public virtual CombinableElement this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the CombinableElement to be set or retrieved.

## Returns
Returns the CombinableElement at the specified index.